<?php

$regexList = [
    'fname' => '/^[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ\']{2,17}[- \']?[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ]{0,17}$/',
    'lname' => '/^[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ\']{2,17}[- \']?[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ]{0,17}$/',
    'country' => '/^[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ\']{2,17}[- \']?[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ]{0,17}$/',
    'nationality' => '/^[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ\']{2,17}[- \']?[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ]{0,17}$/',
    'city' => '/^[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ\']{2,17}[- \']?[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ]{0,17}$/',
    'degree' => '/^[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ\']{2,17}[- \']?[a-zA-ZçéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ]{0,17}$/',
    'zCode' => '/^[0-9]{5}|[9]{1}[7]{1}[1-6]{1}$/',
    'birthD' => '/^([12]\d{3}-(0[1-9]|1[0-2])-(0[1-9]|[12]\d|3[01]))$/',
    'adress' => '/^[0-9]+[a-zA-ZéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ\' ]{2,15}[- \']?[a-zA-ZéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ ]{0,15}[a-zA-ZéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜ ]{0,15}$/',
    'email' => '/^\w+([\.-]?\w+)*@\w+([\.-]?\w+)*(\.\w{2,3})+$/',
    'phone' => '/^[0][1-9]([-. ]?)(([0-9]{2})\1([0-9]{2}))(\1([0-9]{2})){2}|[+]33[0-9]([-. ]?)(([0-9]{2})\7([0-9]{2}))(\7([0-9]{2})){2}$/',
    'peNbr' => '/^[0-9]{7}[A-Z]$/',
    'codecLink' => '/^(https?:\/\/(?:www\.|(?!www))[a-zA-Z0-9][a-zA-Z0-9-]+[a-zA-Z0-9]\.[^\s]{2,}|www\.[a-zA-Z0-9][a-zA-Z0-9-]+[a-zA-Z0-9]\.[^\s]{2,}|https?:\/\/(?:www\.|(?!www))[a-zA-Z0-9]+\.[^\s]{2,}|www\.[a-zA-Z0-9]+\.[^\s]{2,})$/'
];
?>